insert into artist (artist_name)
	values  ('Пионерлагерь пыльная радуга'),
			('Хаски'),
			('Психея'),
			('Pussy Riot'),
			('Shortparis'),
			('Masha Hima'),
			('DEAD BLONDE'),
			('Скриптонит');

insert into album (album_title, release_year)
	values  ('Так закалялась сталь', 2019),
			('Княжна из хрущевки', 2021),
			('Звукарь', 2018),
			('Уроборос: Улица 36', 2017),
			('Свистки и бумажки', 2021),
			('RAGE REMIXES', 2021),
			('Герой поколения бархат', 2001),
			('Триптих о Человечине', 2018),
			('Тот, кому не нужно счастье', 2022),
			('Мало', 2018),
			('Любимые песни (воображаемых) людей', 2017),
			('2004', 2020);

insert into genre (genre)
	values  ('Хип-хоп'),
			('Альтернативный рок'),
			('Поп'),
			('Авангардная музыка'),
			('Панк-рок'),
			('Электронная музыка');

insert into "genre/artist" (genre_id, artist_id)
	values 	(6, 5),
			(6, 7),
			(1, 2),
			(1, 8),
			(2, 1),
			(2, 3),
			(5, 4),
			(4, 5),
			(3, 6),
			(3, 7),
			(5, 2);

insert into "artist/album" (artist_id, album_id)
	values 	(5, 1),
			(7, 2),
			(6, 3),
			(2, 4),
			(8, 5),
			(4, 6),
			(3, 7),
			(2, 8),
			(1, 9),
			(1, 10),
			(2, 11),
			(8, 12);

insert into track (track_title, track_duration, album_id)
	values 	('Отходняк', 272, 9),
			('Паром', 200, 9),
			('Ветер, который дует с полей', 217, 9),
			('Твой-мой', 203, 9),
			('Бхзрд', 308, 10),
			('Газ', 275, 10),
			('Нелюбовь', 275, 1),
			('Жизнь за царя', 212, 1),
			('Бесприданница', 180, 2),
			('Voulez-vous coucher', 193, 2),
			('Клофелин', 217, 3),
			('Звукарь', 251, 3),
			('Животные', 182, 4),
			('Положение', 282, 4),
			('Трата времени', 217, 4),
			('Жить как я живу', 217, 5),
			('Прям с утра', 219, 5),
			('Лепесток', 259, 5),
			('PANIC ATTACK (Count Baldor Remix)', 135, 6),
			('Нет (Серебряной пулей)', 267, 7),
			('Убей меня дважды)', 314, 7),
			('Человек в Интернете', 211, 8),
			('Убить Рэпера', 140, 8),
			('Панелька', 182, 11),
			('Панк и рок-н-ролл', 202, 10),
			('Москва любит...', 205, 12);

insert into collection (collection_title, release_year)
	values 	('Хиты русского рэпа', 2021),
			('Пионерлагерь Пыльная Радуга: радио', 2022),
			('Русский рейв', 2022),
			('Поэты русского рэпа', 2020),
			('Без меня. Трибьют Егора Летова', 2019),
			('Сборник 2017', 2017),
			('Сборник 2018', 2018),
			('Сборник 2021', 2021);
	
insert into "collection/track" (collection_id, track_id)
	values 	(1, 24),
			(2, 5),
			(3, 9),
			(4, 24),
			(4, 16),
			(5, 25),
			(6, 13),
			(6, 24),
			(7, 23),
			(7, 6),
			(8, 9),
			(8, 1);